import { FAQItem } from '@/components/about/FAQItem'

export const faqData: FAQItem[] = [
  {
    id: 1,
    question: 'كيف يمكنني تتبع طلبي؟',
    answer:
      'يمكنك تتبع طلبك من خلال الضغط على "طلباتي" في الصفحة الرئيسية ثم اختيار الطلب الذي تريد تتبعه.',
  },
  {
    id: 2,
    question: 'ما هي طرق الدفع المتاحة؟',
    answer:
      'نقبل الدفع عن طريق البطاقات الائتمانية، الدفع عند الاستلام، وبطاقات مدى.',
  },
  {
    id: 3,
    question: 'كم تستغرق عملية التوصيل؟',
    answer: 'عادةً ما يستغرق التوصيل من 3-5 أيام عمل داخل المدن الرئيسية.',
  },
  {
    id: 4,
    question: 'هل يمكنني إلغاء طلبي؟',
    answer: 'نعم، يمكنك إلغاء طلبك قبل شحنه. بمجرد شحن الطلب، لا يمكن إلغاؤه.',
  },
  {
    id: 5,
    question: 'ما هي سياسة الإرجاع؟',
    answer:
      'نقبل الإرجاع خلال 14 يوماً من تاريخ الاستلام شرط أن يكون المنتج في حالته الأصلية.',
  },
]
